[
    {
        "categoryName": "SAMSUNG",
        "title": "Samsung Galaxy Z Flip4",
        "productId": "122647827883783778",
        "img": "https://fdn2.gsmarena.com/vv/pics/samsung/samsung-galaxy-z-flip4-5g-01.jpg",
        "sellerName": "Karim Ali",
        "location": "Dhaka",
        "sellerEmail": "harun1@gmail.com",
        "originalPrice": "9999",
        "resalePrice": "6890",
        "yearsOfUse": "1",
        "postedTime": "2022-11-23T01:17:42.136Z",
        "conditionType": "Excellent",
        "sellerMobileNumber": "3445545666",
        "YearOfPurchase": "2021",
        "description": "The Galaxy Z Flip 4 has two screens: its foldable inner 6.7-inch display with a 120 Hz variable refresh rate and its 1.9-inch cover display.The device has 8 GB of RAM, and either 128 GB, 256 GB or 512 GB of UFS 3.1 flash storage, with no support for expanding the device's storage capacity via micro-SD cards.The Z Flip 4 is powered by the Qualcomm Snapdragon 8+ Gen 1.The device's included battery is a 3700 mAh dual-cell unit that fast charges via USB-C up to 25 W, or via wireless charging up to 10 W.The Z Flip 4 features two rear cameras, including a 12 MP wide-angle camera and a 12 MP ultra-wide camera. It has a 10 MP front-facing camera at the top of the display.The Samsung Galaxy Z Flip 4 ships with Android 12 based One UI 4.1."
    },
    {
        "categoryName": "SAMSUNG",
        "title": "Samsung Galaxy M13 5G",
        "productId": "147925646437772372",
        "img": "https://fdn2.gsmarena.com/vv/pics/samsung/samsung-galaxy-m13-5g-1.jpg",
        "sellerName": "Rahim Ali",
        "location": "Dhaka",
        "sellerEmail": "harun1@gmail.com",
        "originalPrice": "8990",
        "resalePrice": "5990",
        "yearsOfUse": "3",
        "postedTime": "2022-11-7T01:17:42.136Z",
        "conditionType": "Excellent",
        "sellerMobileNumber": "56445545666",
        "YearOfPurchase": "2019",
        "description": "The Samsung Galaxy M series is a line of online-exclusive budget smartphones manufactured by Samsung Electronics. The first models in the series, the Samsung Galaxy M10 and M20, were released on February 5, 2019; they were followed by the Samsung Galaxy M30 on March 7 and the Samsung Galaxy M40 on June 18. The Galaxy M10s and M30s were announced on September 18, and both were released on September 29. The Galaxy M01 and M11 were released on June 2 2020 and were available for sale on both online and offline platforms.On September 10, Samsung announced the Galaxy M51, the first upper mid-range model in the lineup.The primary selling point of the lineup is the high-capacity battery and multi-lens camera setup, following the common trend within budget smartphones in 2019. It is positioned below the more streamlined, mid-range Galaxy A series, although the newer, higher-end models were derived from the A series with several alterations.Being positioned at the mid-range and low-end segments, all models in the series have the all essential features of an entry-level smartphone, besides some other advanced features, thus differentiating them from other series and also differ in size and design. Samsung targets Asian developing markets or the European entry-level market with the lineup as a response to the growing popularity of budget smartphones offered by Chinese manufacturers such as Xiaomi, Huawei and BBK Electronics."
    },
    {
        "categoryName": "APPLE",
        "title": "Apple iPhone 12 Pro",
        "productId": "212147363673728513",
        "img": "https://fdn2.gsmarena.com/vv/pics/apple/apple-iphone-12-pro-2.jpg",
        "sellerName": "Jakir Ali",
        "location": "khulna",
        "sellerEmail": "Jakir2@gmail.com",
        "originalPrice": "19999",
        "resalePrice": "16890",
        "yearsOfUse": "3",
        "postedTime": "2022-11-12T01:17:42.136Z",
        "conditionType": "Excellent",
        "sellerMobileNumber": "437845545666",
        "YearOfPurchase": "2020",
        "description": "The iPhone 12 Pro uses Apple's six-core A14 Bionic processor, which contains a 16-core neural engine. It has three internal storage options: 128, 256, and 512 GB. The iPhone 12 Pro has an IP68 water and dust-resistant rating along with dirt and grime, and is water-resistant up to six meters (20 feet) for 30 minutes.The iPhone 12 Pro, like the iPhone 12, is not supplied with EarPods (except in France) or the power adapter included with prior iPhone models. Apple claims this will reduce carbon emissions and that most users already own these items.[25] Apple still supplies the USB-C to Lightning cable that was introduced with the iPhone 11 Pro. In addition to Lightning and Qi wireless charging, the phones introduce MagSafe wireless charging, a new magnet-based charging and accessory system that allow accessories such as chargers and cases to snap onto the back of the phones. MagSafe wireless charging supports up to 15 watts, is fast-charge capable, and is a reimagining of the MagSafe brand that was introduced in 2006 with the original MacBook Pro. The MagSafe Charger can be purchased separately, along with a variety of cases and other accessories.The iPhone 12 Pro and 12 Pro Max support 5G cellular communications. This allows upload speeds of up to 200 Mbit/s (1 Mbit/s = 1 million bits per second) and download speeds of up to 4 Gbit/s. However, only models sold in the U.S. support the faster mmWave technology; those sold elsewhere in the world, including Canada, only support sub-6 GHz frequency bands. A new feature called Smart Data Mode enables 5G only when necessary to preserve battery life and data usage.The iPhone 12 Pro has a 6.06 inch (154 mm) (marketed as 6.1 inch) OLED display with a resolution of 2532 × 1170 pixels (2.9 megapixels) at 460 ppi, while the iPhone 12 Pro Max has a 6.68 inch (170 mm) (marketed as 6.7 inch) OLED display with a resolution of 2778 × 1284 pixels (3.5 megapixels) at 458 ppi. Both models have the Super Retina XDR OLED display with thinner bezels than previous generation iPhones. The iPhone 12 Pro Max features the largest display on any iPhone to date.[26] The phones also introduce a new glass-ceramic covering, named 'Ceramic Shield', which was co-developed with Corning Inc.Both the iPhone 12 Pro and iPhone 12 Pro Max are supplied with the Apple A14 Bionic, the first ARM-based smartphone system-on-a-chip (SoC) manufactured on the 5 nm process node.[31] However, unlike previous years, the iPhone 12 Pro and iPhone 12 Pro Max are not the first Apple devices to receive the newest A-series processor, with the fourth-generation iPad Air being the first device from Apple to contain the A14 Bionic chip.[31] The iPhone 12 Pro and iPhone 12 Pro Max also contain the Apple M14 motion coprocessor. The iPhone 12 Pro and iPhone 12 Pro Max use Qualcomm's X55 5G modem.The iPhone 12 Pro features four cameras: one front-facing camera and three back-facing cameras, including a telephoto, wide, and ultra-wide camera. The iPhone 12 Pro also features a LiDAR scanner for AR and computer-aided photo enhancement services. The iPhone 12 Pro also adds Night Mode for time-lapse video recording on all four cameras.[32] Unlike the iPhone 11 Pro and iPhone 11 Pro Max where the only difference was the screen size and battery capacity, the iPhone 12 Pro Max adds a 47% larger sensor and sensor-shift image stabilization to the main camera lens, and replaces the f/2.0 aperture 52 mm telephoto camera lens with a f/2.2 aperture 65 mm lens, allowing for a 2.5x optical zoom. The iPhone 12 Pro and iPhone 12 Pro Max are the first smartphones capable of shooting in 10-bit high dynamic range Dolby Vision 4K video at up to 60 frames per second."
    },
    {
        "categoryName": "APPLE",
        "title": "Apple iPhone 11 Pro",
        "productId": "213427634584643514",
        "img": "https://fdn.gsmarena.com/imgroot/reviews/19/apple-iphone-11-pro-max/lifestyle/-1024w2/gsmarena_011.jpg",
        "sellerName": "Jamshed",
        "location": "Dhaka",
        "sellerEmail": "Jamshed@gmail.com",
        "originalPrice": "12090",
        "resalePrice": "10090",
        "yearsOfUse": "6",
        "postedTime": "2022-11-17T01:17:42.136Z",
        "conditionType": "Excellent",
        "sellerMobileNumber": "565445545666",
        "YearOfPurchase": "2015",
        "description": "The iPhone 11 Pro and iPhone 11 Pro Max are smartphones designed, developed and marketed by Apple Inc. Serving as the Apple's flagship models of the 13th-generation of iPhones, they succeeded the iPhone XS and iPhone XS Max, respectively, upon their release. Apple CEO Tim Cook unveiled the devices alongside the standard model, the iPhone 11, on September 10, 2019, at the Steve Jobs Theater at Apple Park. Pre-orders began on September 13, 2019, and the phones went on sale on September 20.[8] They were discontinued on October 13, 2020, following the announcement of iPhone 12 and iPhone 12 Pro.Notable improvements over the previous devices include the triple-lens rear camera system and the A13 Bionic chip.[9] The 11 Pro and 11 Pro Max are Apple's first iPhones to feature a pro designation, previously used only for larger Apple devices, such as the iPad Pro and MacBook Pro.[10] They are also the first generation of iPhones which include a Lightning to USB-C cable and that allows connection to the charger and to current Mac computers, in the box.[11].design featured since the iPhone X were correctly predicted in leaks.[12][13][14] Some leaks, however, were inaccurate; the inclusion of bilateral charging was widely anticipated and publicized, but was not part of the phone's design.[15][16] Official release event invites sent out to press featured layered colored glass elements organized to form the Apple logo, which some reviewers drew similarities to Apple's original logo, suggesting new colors for the phone, and to a patent Apple filed for a new camera design earlier.[17][18]The iPhone 11 and 11 Pro were unveiled in a press event at the Steve Jobs Theater in Cupertino, California on September 10, 2019; the first Apple event live streamed on YouTube.[19] The event featured various other products and services other than the iPhone, including a new Apple Watch, a new iPad, Apple TV+, and Apple Arcade.[20] Pre-orders began on September 13, with the iPhone 11 Pro starting from a base price of $999, and the larger screen Pro Max starting from $1,099. The phones were released on September 20.[21]The iPhone 11 Pro and 11 Pro Max is available in Gold, Silver, Space Gray, and Midnight Green, a new color previously not available on iPhones.[25] Similar to the iPhone XS and XS Max respectively, there is a display cutout at the front that includes the 12 MP TrueDepth camera system and speaker. There is also a new rear camera design with three lenses and a flash in a larger, square-shaped bump, which is the most visible difference compared to the iPhone XS.[26][27] The Apple logo is now centered on the back of the device with no text, and the glass has a frosted matte finish, unlike the glossy finish found on other glass-backed iPhones.The iPhone 11 Pro and 11 Pro Max both have an A13 Bionic processor. Both phones have three internal storage options: 64 GB, 256 GB, and 512 GB, and have 4 GB of RAM.[1] Both models are rated IP68 water and dust resistant, and are resistant for 30 minutes at a depth of 4 meters. The warranty does not cover any water damage to the phone. Continuing the trend set starting with the iPhone 7, neither phone includes a headphone jack, but came with wired EarPods with a Lightning connector prior to Apple's decision to halt inclusion of them in October 2020, citing environmental impact.[27] The iPhone 11 Pro and Pro Max are the first and only iPhones to be sold with a USB-C 18-watt fast charger.[28]"
    },
    {
        "categoryName": "HUAWEI",
        "title": "Huawei P50E",
        "productId": "312452554562376815",
        "img": "https://fdn2.gsmarena.com/vv/pics/huawei/huawei-p50e-1.jpg",
        "sellerName": "Shaheed miya",
        "location": "Dhaka",
        "sellerEmail": "shaheed@gmail.com",
        "originalPrice": "1499",
        "resalePrice": "1890",
        "yearsOfUse": "1",
        "postedTime": "2022-11-22T01:17:42.136Z",
        "conditionType": "Excellent",
        "sellerMobileNumber": "86763445545666",
        "YearOfPurchase": "2021",
        "description": "The P50 operates on the Adreno 660 GPU. The phone has 8GB ram only and has 128 GB or 256 GB storage space which allows for more storage and smooth run of the device. Expansion is supported up to 256 GB via Huawei's proprietary Nano Memory card. The P50 display was upgraded by 0.4 from the previous P40 which had 6.1 for display. The new 6.5 inches (101.6 cm) 88.0% screen-to-body ratio with a resolution of 1224 x 2700 pixels OLED with a 1B color and 90Hz refresh rate. The P50 model has an optical (under-screen) fingerprint sensor.[4].P50 uses traditional RGGB sensor instead. The P50's rear camera array consists of a 50 MP wide lens, a 13MP 16mm ultrawide lens and an 12MP telephoto lens with 5x optical zoom. For P50 Pro, 50 MP wide lens now has optical image stablization. The 13 MP ultrawide is now wider in 13mm, the periscope telephoto now has a 64 MP sensor at 3.5x and an additional 40 MP monochrome sensor to capture more light. The software is also improved with a new Golden Snap feature that takes a burst of HDR+ photos and automatically picks the best shots. A Profoto studio light will be available as an accessory as well.[6][7].The device runs on HarmonyOS 2.0. The P50 series support Huawei Mobile Services uses Huawei AppGallery as its main app store. Furthermore, a new app known as Petal Search was introduced, which includes web search via France-based Qwant and Russia-based Yandex, as well as the ability to search for third-party apps via other Android app stores and APK mirroring websites.Don’t think that it’s not powerful, though. Its 50MP primary camera sensor is a solid piece of hardware, and it comes with a minimum of 8GB of RAM and 128GB of internal storage. It also features 66W wired charging, which should charge up its 4,100mAh battery from empty to full in around 30-40 minutes.Thanks to the Huawei ban, the company has fallen out of favor in the smartphone industry. After briefly hitting the top slot of worldwide manufacturers in 2020, the company has dropped so far down the list that it’s not even in the top five anymore. Still, Huawei hasn’t stopped launching phones, and the Huawei P50 series is the newest high-end series from the company."
    },
    {
        "categoryName": "HUAWEI",
        "title": "Huawei Mate 50 Pro",
        "productId": "336245334056446816",
        "img": "https://fdn2.gsmarena.com/vv/pics/huawei/huawei-mate-50-pro-1.jpg",
        "sellerName": "Mahmud jhalim",
        "location": "Dhaka",
        "sellerEmail": "mahmud@gmail.com",
        "originalPrice": "22990",
        "resalePrice": "15990",
        "yearsOfUse": "8",
        "postedTime": "2022-11-27T01:17:42.136Z",
        "conditionType": "Excellent",
        "sellerMobileNumber": "789644554564",
        "YearOfPurchase": "2014",
        "description": "The Huawei Mate series (previously the Huawei Ascend Mate series) is a line of high-end HarmonyOS-powered (formerly Android based) phablet smartphones produced by Huawei, and is one of the flagship smartphones along with the P series. Under the company's current hardware release cadence, P series phones are typically directed towards mainstream consumers as the company's flagship smartphones, refining and expanding upon technologies introduced in Mate series devices (which are typically positioned towards early adopters).[1] Since 2016, Huawei has been in a co-engineering partnership with the German manufacturer Leica, whose lenses have subsequently been used on the Mate series.[2].finish with various color options, designed to improve grip and reduce susceptibility to fingerprint smudging.[1] The Mate 20 Pro has IP68 certification. Both models utilise the Kirin 980 system-on-chip, an octa-core SoC featuring Cortex-A76 and Cortex-A55 CPU cores, Mali-G76 MP10 GPU, and a pair of AI accelerators. It was promoted as being the first commercially produced SoC utilising a 7 nanometer production process.[2][3] Both models feature USB-C connectors, while the Mate 20 Pro does not include a headphone jack.[3] The device features front stereo speakers with Dolby Atmos support.[4].and the Mate 20 Pro containing a larger tab concealing additional infrared sensors used for a face recognition system.[5] The Mate 20 Pro includes an optical in-screen fingerprint reader.[6] The Mate 20 uses a physical fingerprint sensor on the rear below the cameras instead. Mate 20 Pro model support Qi inductive charging, including reverse charging of other Qi-compatible devices from its own battery power.[3][2][7] For storage expansion, the Mate 20 utilises a new, proprietary memory card format known as Nano Memory rather than MicroSD, which exactly matches the dimensions of a Nano-SIM card. As such, the devices utilise a hybrid SIM tray where the second slot can be used for either expanded storage or a second SIM card.[8].The Mate 20 features three rear-facing cameras with Leica optics in a square-shaped array, with the Mate 20 Pro using 40-megapixel wide angle IMX600, 20-megapixel ultra wide angle, and 8-megapixel telephoto sensors, and the Mate 20 using 12-megapixel, 16-megapixel ultra wide angle, and 8-megapixel telephoto sensors. Unlike previous Huawei phones, it does not include a monochrome lens for contrast adjustment and greyscale images, with the company citing improvements to the colour sensors as making it redundant. This is accompanied by improvements to Huawei's artificial intelligence object recognition system, which can now distinguish between multiple types of subjects in a scene to selectively apply enhancements (rather than only applying one to the entire photo) and can recognize 1,500 possible scenarios (a three-fold increase over the P20's similar system). The camera software also features new AI Cinema effects modes.[1] Both devices feature 24-megapixel front-facing cameras.[3]The Mate 20 X is a larger variant of the Mate 20, featuring a 7.2-inch display, a headphone jack, a 5,000 mAh battery, vapour chamber cooling and support for an optional stylus. It features the same camera setup as the Mate 20 Pro, but lacks wireless charging. Unlike the Mate 20 Pro, its display is flat, and it uses a rear-mounted fingerprint reader.[14] The phone is using graphene film cooling technology for thermal management, and is one of the first commercial products to utilize graphene for such purposes.[15][16][17] A 5G variant was announced on May 17, 2019. It is nearly identical to the original Mate 20 X, but has a smaller 4,200 mAh battery and support for 40W fast charging. It lacks a headphone jack and only comes in one color, Emerald Green.[18]."
    }

]